Microchip-MPLAB-Harmony/csp/apps/uart/uart_echo_blocking/firmware/src/packs/ATSAMA5D27_DFP/component/pio.h
/* -------- PIO_ISR : (PIO Offset: 0x2C) ( R/ 32) PIO Interrupt Status Register -------- */
#define PIO_ISR_P0_Pos                        _U_(0)                                               /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P0_Msk                        (_U_(0x1) << PIO_ISR_P0_Pos)                         /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P0(value)                     (PIO_ISR_P0_Msk & ((value) << PIO_ISR_P0_Pos))      
#define PIO_ISR_P1_Pos                        _U_(1)                                               /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P1_Msk                        (_U_(0x1) << PIO_ISR_P1_Pos)                         /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P1(value)                     (PIO_ISR_P1_Msk & ((value) << PIO_ISR_P1_Pos))      
#define PIO_ISR_P2_Pos                        _U_(2)                                               /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P2_Msk                        (_U_(0x1) << PIO_ISR_P2_Pos)                         /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P2(value)                     (PIO_ISR_P2_Msk & ((value) << PIO_ISR_P2_Pos))      
#define PIO_ISR_P3_Pos                        _U_(3)                                               /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P3_Msk                        (_U_(0x1) << PIO_ISR_P3_Pos)                         /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P3(value)                     (PIO_ISR_P3_Msk & ((value) << PIO_ISR_P3_Pos))      
#define PIO_ISR_P4_Pos                        _U_(4)                                               /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P4_Msk                        (_U_(0x1) << PIO_ISR_P4_Pos)                         /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P4(value)                     (PIO_ISR_P4_Msk & ((value) << PIO_ISR_P4_Pos))      
#define PIO_ISR_P5_Pos                        _U_(5)                                               /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P5_Msk                        (_U_(0x1) << PIO_ISR_P5_Pos)                         /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P5(value)                     (PIO_ISR_P5_Msk & ((value) << PIO_ISR_P5_Pos))      
#define PIO_ISR_P6_Pos                        _U_(6)                                               /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P6_Msk                        (_U_(0x1) << PIO_ISR_P6_Pos)                         /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P6(value)                     (PIO_ISR_P6_Msk & ((value) << PIO_ISR_P6_Pos))      
#define PIO_ISR_P7_Pos                        _U_(7)                                               /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P7_Msk                        (_U_(0x1) << PIO_ISR_P7_Pos)                         /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P7(value)                     (PIO_ISR_P7_Msk & ((value) << PIO_ISR_P7_Pos))      
#define PIO_ISR_P8_Pos                        _U_(8)                                               /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P8_Msk                        (_U_(0x1) << PIO_ISR_P8_Pos)                         /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P8(value)                     (PIO_ISR_P8_Msk & ((value) << PIO_ISR_P8_Pos))      
#define PIO_ISR_P9_Pos                        _U_(9)                                               /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P9_Msk                        (_U_(0x1) << PIO_ISR_P9_Pos)                         /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P9(value)                     (PIO_ISR_P9_Msk & ((value) << PIO_ISR_P9_Pos))      
#define PIO_ISR_P10_Pos                       _U_(10)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P10_Msk                       (_U_(0x1) << PIO_ISR_P10_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P10(value)                    (PIO_ISR_P10_Msk & ((value) << PIO_ISR_P10_Pos))    
#define PIO_ISR_P11_Pos                       _U_(11)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P11_Msk                       (_U_(0x1) << PIO_ISR_P11_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P11(value)                    (PIO_ISR_P11_Msk & ((value) << PIO_ISR_P11_Pos))    
#define PIO_ISR_P12_Pos                       _U_(12)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P12_Msk                       (_U_(0x1) << PIO_ISR_P12_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P12(value)                    (PIO_ISR_P12_Msk & ((value) << PIO_ISR_P12_Pos))    
#define PIO_ISR_P13_Pos                       _U_(13)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P13_Msk                       (_U_(0x1) << PIO_ISR_P13_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P13(value)                    (PIO_ISR_P13_Msk & ((value) << PIO_ISR_P13_Pos))    
#define PIO_ISR_P14_Pos                       _U_(14)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P14_Msk                       (_U_(0x1) << PIO_ISR_P14_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P14(value)                    (PIO_ISR_P14_Msk & ((value) << PIO_ISR_P14_Pos))    
#define PIO_ISR_P15_Pos                       _U_(15)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P15_Msk                       (_U_(0x1) << PIO_ISR_P15_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P15(value)                    (PIO_ISR_P15_Msk & ((value) << PIO_ISR_P15_Pos))    
#define PIO_ISR_P16_Pos                       _U_(16)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P16_Msk                       (_U_(0x1) << PIO_ISR_P16_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P16(value)                    (PIO_ISR_P16_Msk & ((value) << PIO_ISR_P16_Pos))    
#define PIO_ISR_P17_Pos                       _U_(17)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P17_Msk                       (_U_(0x1) << PIO_ISR_P17_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P17(value)                    (PIO_ISR_P17_Msk & ((value) << PIO_ISR_P17_Pos))    
#define PIO_ISR_P18_Pos                       _U_(18)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P18_Msk                       (_U_(0x1) << PIO_ISR_P18_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P18(value)                    (PIO_ISR_P18_Msk & ((value) << PIO_ISR_P18_Pos))    
#define PIO_ISR_P19_Pos                       _U_(19)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P19_Msk                       (_U_(0x1) << PIO_ISR_P19_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P19(value)                    (PIO_ISR_P19_Msk & ((value) << PIO_ISR_P19_Pos))    
#define PIO_ISR_P20_Pos                       _U_(20)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P20_Msk                       (_U_(0x1) << PIO_ISR_P20_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P20(value)                    (PIO_ISR_P20_Msk & ((value) << PIO_ISR_P20_Pos))    
#define PIO_ISR_P21_Pos                       _U_(21)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P21_Msk                       (_U_(0x1) << PIO_ISR_P21_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P21(value)                    (PIO_ISR_P21_Msk & ((value) << PIO_ISR_P21_Pos))    
#define PIO_ISR_P22_Pos                       _U_(22)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P22_Msk                       (_U_(0x1) << PIO_ISR_P22_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P22(value)                    (PIO_ISR_P22_Msk & ((value) << PIO_ISR_P22_Pos))    
#define PIO_ISR_P23_Pos                       _U_(23)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P23_Msk                       (_U_(0x1) << PIO_ISR_P23_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P23(value)                    (PIO_ISR_P23_Msk & ((value) << PIO_ISR_P23_Pos))    
#define PIO_ISR_P24_Pos                       _U_(24)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P24_Msk                       (_U_(0x1) << PIO_ISR_P24_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P24(value)                    (PIO_ISR_P24_Msk & ((value) << PIO_ISR_P24_Pos))    
#define PIO_ISR_P25_Pos                       _U_(25)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P25_Msk                       (_U_(0x1) << PIO_ISR_P25_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P25(value)                    (PIO_ISR_P25_Msk & ((value) << PIO_ISR_P25_Pos))    
#define PIO_ISR_P26_Pos                       _U_(26)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P26_Msk                       (_U_(0x1) << PIO_ISR_P26_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P26(value)                    (PIO_ISR_P26_Msk & ((value) << PIO_ISR_P26_Pos))    
#define PIO_ISR_P27_Pos                       _U_(27)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P27_Msk                       (_U_(0x1) << PIO_ISR_P27_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P27(value)                    (PIO_ISR_P27_Msk & ((value) << PIO_ISR_P27_Pos))    
#define PIO_ISR_P28_Pos                       _U_(28)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P28_Msk                       (_U_(0x1) << PIO_ISR_P28_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P28(value)                    (PIO_ISR_P28_Msk & ((value) << PIO_ISR_P28_Pos))    
#define PIO_ISR_P29_Pos                       _U_(29)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P29_Msk                       (_U_(0x1) << PIO_ISR_P29_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P29(value)                    (PIO_ISR_P29_Msk & ((value) << PIO_ISR_P29_Pos))    
#define PIO_ISR_P30_Pos                       _U_(30)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P30_Msk                       (_U_(0x1) << PIO_ISR_P30_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P30(value)                    (PIO_ISR_P30_Msk & ((value) << PIO_ISR_P30_Pos))    
#define PIO_ISR_P31_Pos                       _U_(31)                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P31_Msk                       (_U_(0x1) << PIO_ISR_P31_Pos)                        /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P31(value)                    (PIO_ISR_P31_Msk & ((value) << PIO_ISR_P31_Pos))    
#define PIO_ISR_Msk                           _U_(0xFFFFFFFF)                                      /**< (PIO_ISR) Register Mask  */

#define PIO_ISR_P_Pos                         _U_(0)                                               /**< (PIO_ISR Position) Input Change Interrupt Status */
#define PIO_ISR_P_Msk                         (_U_(0xFFFFFFFF) << PIO_ISR_P_Pos)                   /**< (PIO_ISR Mask) P */
#define PIO_ISR_P(value)                      (PIO_ISR_P_Msk & ((value) << PIO_ISR_P_Pos))         

/* -------- PIO_IOFR : (PIO Offset: 0x3C) ( /W 32) PIO I/O Freeze Configuration Register -------- */
#define PIO_IOFR_FPHY_Pos                     _U_(0)                                               /**< (PIO_IOFR) Freeze Physical Configuration Position */
#define PIO_IOFR_FPHY_Msk                     (_U_(0x1) << PIO_IOFR_FPHY_Pos)                      /**< (PIO_IOFR) Freeze Physical Configuration Mask */
#define PIO_IOFR_FPHY(value)                  (PIO_IOFR_FPHY_Msk & ((value) << PIO_IOFR_FPHY_Pos))
#define PIO_IOFR_FINT_Pos                     _U_(1)                                               /**< (PIO_IOFR) Freeze Interrupt Configuration Position */
#define PIO_IOFR_FINT_Msk                     (_U_(0x1) << PIO_IOFR_FINT_Pos)                      /**< (PIO_IOFR) Freeze Interrupt Configuration Mask */
#define PIO_IOFR_FINT(value)                  (PIO_IOFR_FINT_Msk & ((value) << PIO_IOFR_FINT_Pos))
#define PIO_IOFR_FRZKEY_Pos                   _U_(8)                                               /**< (PIO_IOFR) Freeze Key Position */
#define PIO_IOFR_FRZKEY_Msk                   (_U_(0xFFFFFF) << PIO_IOFR_FRZKEY_Pos)               /**< (PIO_IOFR) Freeze Key Mask */
#define PIO_IOFR_FRZKEY(value)                (PIO_IOFR_FRZKEY_Msk & ((value) << PIO_IOFR_FRZKEY_Pos))
#define   PIO_IOFR_FRZKEY_PASSWD_Val          _U_(0x494F46)                                        /**< (PIO_IOFR) Writing any other value in this field aborts the write operation of the WPEN bit.  */
#define PIO_IOFR_FRZKEY_PASSWD                (PIO_IOFR_FRZKEY_PASSWD_Val << PIO_IOFR_FRZKEY_Pos)  /**< (PIO_IOFR) Writing any other value in this field aborts the write operation of the WPEN bit. Position  */
#define PIO_IOFR_Msk                          _U_(0xFFFFFF03)                                      /**< (PIO_IOFR) Register Mask  */


/** \brief PIO register offsets definitions */
#define PIO_MSKR_REG_OFST              (0x00)              /**< (PIO_MSKR) PIO Mask Register Offset */
#define PIO_CFGR_REG_OFST              (0x04)              /**< (PIO_CFGR) PIO Configuration Register Offset */
#define PIO_PDSR_REG_OFST              (0x08)              /**< (PIO_PDSR) PIO Pin Data Status Register Offset */
#define PIO_LOCKSR_REG_OFST            (0x0C)              /**< (PIO_LOCKSR) PIO Lock Status Register Offset */
#define PIO_SODR_REG_OFST              (0x10)              /**< (PIO_SODR) PIO Set Output Data Register Offset */
#define PIO_CODR_REG_OFST              (0x14)              /**< (PIO_CODR) PIO Clear Output Data Register Offset */
#define PIO_ODSR_REG_OFST              (0x18)              /**< (PIO_ODSR) PIO Output Data Status Register Offset */
#define PIO_IER_REG_OFST               (0x20)              /**< (PIO_IER) PIO Interrupt Enable Register Offset */
#define PIO_IDR_REG_OFST               (0x24)              /**< (PIO_IDR) PIO Interrupt Disable Register Offset */
#define PIO_IMR_REG_OFST               (0x28)              /**< (PIO_IMR) PIO Interrupt Mask Register Offset */
#define PIO_ISR_REG_OFST               (0x2C)              /**< (PIO_ISR) PIO Interrupt Status Register Offset */
#define PIO_IOFR_REG_OFST              (0x3C)              /**< (PIO_IOFR) PIO I/O Freeze Configuration Register Offset */

